def task(my_hash_table):
    my_hash_table.insert("Акушер",
                         "специалист, который занимается теоретическими и практическими вопросами беременности и "
                         "помогает женщинам в период беременности и родов")
    my_hash_table.insert("Акушер-гинеколог",
                         "специалист, который занимается теоретическими и практическими вопросами беременности, а "
                         "также разбирается в патологиях и осложнениях, которые могут возникнуть во время родов.")
    my_hash_table.insert("Аллерголог",
                         "врач, лечащий различные аллергические заболевания и иммунообусловленные синдромы")
    my_hash_table.insert("Андролог",
                         "специалист, изучающий мужчин, мужскую анатомию и физиологию, заболевания мужской половой"
                         " сферы и методы их лечения.")
    my_hash_table.insert("Анестезиолог",
                         "специалист, который разбирается в средствах и методах обеспечения анестезии при острых "
                         "болевых синдромах, шоковых состояниях, травмах, хирургических вмешательствах")
    my_hash_table.insert("Венеролог",
                         "специалист, изучающий и лечащий инфекции, передающиеся половым путём")
    my_hash_table.insert("Ветеринар",
                         "специалист, занимающийся лечением животных и сопутствующими обязанностями")
    my_hash_table.insert("Вирусолог",
                         "изучает природу вирусов, их строение, размножение, инфекционные свойства, разрабатывает "
                         "меры по предупреждению, диагностике и лечению вызываемых ими заболеваний")
    my_hash_table.insert("Гинеколог", "специалист по гинекологии")

    my_hash_table.insert("Дерматолог",
                         "специалист, изучающий строение, функционирование и заболевания кожи и её придатков — "
                         "волос, ногтей, а также слизистых оболочек, методы их профилактики и лечения")
    my_hash_table.insert("Диетолог",
                         "специалист, изучающий принципы правильного, рационального питания здорового и больного "
                         "человека, различные диеты и методы лечения различных заболеваний")
    my_hash_table.insert("Кардиолог",
                         "специалист, занимающийся изучением сердечно-сосудистой системы человека")
    my_hash_table.insert("Логопед",
                         "специалист, с чьей помощью определяются и реализуются необходимые методики по устранению"
                         " дефектов речи")
    my_hash_table.insert("Маммолог",
                         "специалист, который занимается диагностикой, лечением и профилактикой различных "
                         "заболеваний молочных желез")
    my_hash_table.insert("Нарколог",
                         "это врач, избавляющий пациентов от алкогольной, табачной, наркотической зависимости, "
                         "выполняющий ее диагностику, лечение и профилактику")
    my_hash_table.insert("Нефролог", "специалист, изучающий функции и болезни почек")
    my_hash_table.insert("Офтальмолог",
                         "специалист, изучающий анатомию и физиологию органов зрения, болезни глаза и "
                         "разрабатывающий методы лечения и профилактики")
    my_hash_table.insert("Онколог",
                         "специалист, изучающий опухоли, их причины и условия происхождения и патогенез , "
                         "методы профилактики и лечения")
    my_hash_table.insert("Ортопед",
                         "специалист, который занимается диагностикой, лечением и профилактикой заболеваний "
                         "опорно-двигательного аппарата")
    """
    my_hash_table.insert("Педиатр",
                         "врач, обеспечивающий сохранение или возвращение (при болезни) состояния здоровья "
                         "ребёнку, позволяющее ему максимально полно реализовать свой врождённый потенциал жизни")
    my_hash_table.insert("Проктолог",
                         "специалист, изучающий болезни толстой (прямой и ободочной) кишки, заднего прохода и "
                         "параректальной области")
    my_hash_table.insert("Психиатр",
                         "врач, получивший специальную подготовку по психиатрии и владеющий методами диагностики, "
                         "лечения, профилактики и экспертизы психических заболеваний.")
    my_hash_table.insert("Психотерапевт",
                         "это психолог или врач, который прошёл переподготовку для получения разрешения на "
                         "практику в области психотерапии")
    my_hash_table.insert("Терапевт",
                         "медик, занимающийся диагностикой, изучением причин, лечением и профилактикой "
                         "заболеваний внутренних органов")
   """
    return my_hash_table
